{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2026-04-27T07:06:08.461282Z",
     "start_time": "2026-04-27T07:06:02.137138Z"
    }
   },
   "source": [
    "from langchain_deepseek import ChatDeepSeek\n",
    "from langchain_neo4j import Neo4jGraph\n",
    "from configuration.config import *\n",
    "\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=NEO4j_CONFIG[\"uri\"],\n",
    "    username=NEO4j_CONFIG[\"auth\"][0],\n",
    "    password=NEO4j_CONFIG[\"auth\"][1],\n",
    "\n",
    ")"
   ],
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-27T07:06:20.176969Z",
     "start_time": "2026-04-27T07:06:20.173969Z"
    }
   },
   "cell_type": "code",
   "source": "print(graph.schema)",
   "id": "d4d61949c2eab377",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Category1 {id: INTEGER, name: STRING}\n",
      "Category2 {id: INTEGER, name: STRING}\n",
      "Category3 {id: INTEGER, name: STRING}\n",
      "BaseAttrName {id: INTEGER, name: STRING}\n",
      "BaseAttrValue {id: INTEGER, name: STRING}\n",
      "SPU {id: INTEGER, name: STRING}\n",
      "SKU {id: INTEGER, name: STRING}\n",
      "Trademark {id: INTEGER, name: STRING}\n",
      "SaleAttrName {id: INTEGER, name: STRING}\n",
      "SaleAttrValue {id: INTEGER, name: STRING}\n",
      "Tag {id: STRING, name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Category1)-[:Have]->(:BaseAttrName)\n",
      "(:Category2)-[:Belong]->(:Category1)\n",
      "(:Category2)-[:Have]->(:BaseAttrName)\n",
      "(:Category3)-[:Belong]->(:Category2)\n",
      "(:Category3)-[:Have]->(:BaseAttrName)\n",
      "(:BaseAttrName)-[:Have]->(:BaseAttrValue)\n",
      "(:SPU)-[:Have]->(:Tag)\n",
      "(:SPU)-[:Have]->(:SaleAttrName)\n",
      "(:SPU)-[:Belong]->(:Trademark)\n",
      "(:SPU)-[:Belong]->(:Category3)\n",
      "(:SKU)-[:Have]->(:BaseAttrValue)\n",
      "(:SKU)-[:Have]->(:SaleAttrValue)\n",
      "(:SKU)-[:Belong]->(:SPU)\n",
      "(:SaleAttrName)-[:Have]->(:SaleAttrValue)\n"
     ]
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-27T07:08:19.018186Z",
     "start_time": "2026-04-27T07:08:18.905790Z"
    }
   },
   "cell_type": "code",
   "source": [
    "cypher = \"Match (n) Return n LIMIT 5\"\n",
    "graph.query(cypher)"
   ],
   "id": "a4fa4b7c23f467c3",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n': {'name': '手机饰品', 'id': 83}},\n",
       " {'n': {'name': '拍照配件', 'id': 84}},\n",
       " {'n': {'name': '手机支架', 'id': 85}},\n",
       " {'n': {'name': '平板电视', 'id': 86}},\n",
       " {'n': {'name': '空调', 'id': 87}}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-27T07:11:51.416435Z",
     "start_time": "2026-04-27T07:11:50.324010Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from langchain_deepseek import ChatDeepSeek\n",
    "\n",
    "llm =ChatDeepSeek(\n",
    "    model = \"deepseek-chat\",\n",
    "    api_key = DEEPSEEK_API_KEY,\n",
    "    temperature=1\n",
    ")"
   ],
   "id": "dbf32dbf6e70dd25",
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-27T07:13:38.258052Z",
     "start_time": "2026-04-27T07:13:38.254045Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from langchain_neo4j import GraphCypherQAChain\n",
    "chain = GraphCypherQAChain.from_llm(graph=graph,llm=llm,verbose=True,allow_dangerous_requests=True)"
   ],
   "id": "79c6482f246975bd",
   "outputs": [],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-27T07:14:17.330485Z",
     "start_time": "2026-04-27T07:14:11.402737Z"
    }
   },
   "cell_type": "code",
   "source": "result = chain.invoke({\"query\":\"华为有哪些产品\"})\n",
   "id": "d51ad143308dc05e",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001B[1m> Entering new GraphCypherQAChain chain...\u001B[0m\n",
      "Generated Cypher:\n",
      "\u001B[32;1m\u001B[1;3mMATCH (t:Trademark {name: '华为'})-[:Belong]-(:SPU)-[:Belong]-(:Category3)\n",
      "MATCH (s:SKU)-[:Belong]->(:SPU)-[:Belong]->(t)\n",
      "RETURN DISTINCT s.name AS productName\u001B[0m\n",
      "Full Context:\n",
      "\u001B[32;1m\u001B[1;3m[{'productName': '华为智慧屏V55i-J 55英寸 HEGE-550B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 银钻灰 京品家电'}, {'productName': '华为智慧屏V65i 65英寸 HEGE-560B 4K全面屏智能电视机 多方视频通话 AI升降摄像头 4GB+32GB 星际黑'}, {'productName': '华为Mate 40 pro 5G全网通麒麟9000芯片鸿蒙国货NFC双卡游戏学生 黑色 8+128 送适用100w充电器'}, {'productName': '华为HUAWEI二手笔记本MateBook13触屏2K全面屏 便携二手笔记本电脑 Magic R5-2500-8G-256G-高分屏 95成新'}, {'productName': 'HAWEIAI Book【补贴30%】2025英特尔14 Pro满血独显笔记本电脑轻薄本高端高性能金属游戏设计大学生【2.5K全面屏+抗蓝光+指纹】 32G内存+2TB超速硬盘'}]\u001B[0m\n",
      "\n",
      "\u001B[1m> Finished chain.\u001B[0m\n"
     ]
    }
   ],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-04-27T07:14:42.114302Z",
     "start_time": "2026-04-27T07:14:42.109806Z"
    }
   },
   "cell_type": "code",
   "source": "result",
   "id": "de16f91fbd3af3ab",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'query': '华为有哪些产品',\n",
       " 'result': '华为的产品包括：华为智慧屏V55i-J 55英寸 4K全面屏智能电视机、华为智慧屏V65i 65英寸 4K全面屏智能电视机、华为Mate 40 Pro 5G全网通智能手机、华为MateBook 13触屏二手笔记本电脑，以及一款HAWEIAI Book 2025英特尔14 Pro笔记本电脑。'}"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "5167e504fee1c0b0"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
